In [2]:
import pandas as pd
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import csv
import scipy.stats as stats
import seaborn
from keplergl import KeplerGl

In [3]:
lat_lng_data = 'code_lat_lng.csv'

In [4]:
lat_lng_df = pd.read_csv(lat_lng_data)
lat_lng_df.head()

  airport_code     lat      lng
0          AAA -17.353 -145.510
1          AAE  36.822    7.809
2          AAH  50.823    6.187
3          AAL  57.093    9.849
4          AAO   9.429  -64.471

In [5]:
lat_lng_df.count()

airport_code    3561
lat             9299
lng             9299
dtype: int64

In [6]:
drop_lat_lng_df = lat_lng_df.dropna()

In [7]:
drop_lat_lng_df.count()

airport_code    3561
lat             3561
lng             3561
dtype: int64

In [8]:
route_code_data = 'route_code_data.csv'

In [9]:
route_df = pd.read_csv(route_code_data)
route_df.head()

  source_airport destination_airport
0            AER                 KZN
1            ASF                 KZN
2            ASF                 MRV
3            CEK                 KZN
4            CEK                 OVB

In [10]:
route_df = route_df.rename(columns={'source_airport': 'source_code', 'destination_airport': 'destination_code'})
route_df.head()

  source_code destination_code
0         AER              KZN
1         ASF              KZN
2         ASF              MRV
3         CEK              KZN
4         CEK              OVB

In [11]:
route_df.count()

source_code         67663
destination_code    67663
dtype: int64

In [12]:
source_code_data = 'source_code.csv'

In [13]:
source_df = pd.read_csv(source_code_data)
source_df.head()

  airport_code
0          AER
1          ASF
2          ASF
3          CEK
4          CEK

In [14]:
destination_code_data = 'destination_code.csv'

In [15]:
destination_df = pd.read_csv(destination_code_data)
destination_df.head()

  airport_code
0          KZN
1          KZN
2          MRV
3          KZN
4          OVB

In [16]:
source_complete = pd.merge(
    source_df, lat_lng_df, how="right", on=["airport_code", "airport_code"])

source_complete.head()

  airport_code     lat     lng
0          AER  43.446  39.947
1          AER  43.446  39.947
2          AER  43.446  39.947
3          AER  43.446  39.947
4          AER  43.446  39.947

In [18]:
source_complete = source_complete.rename(columns={'airport_code': 'source_code', 'lat': 'slat', 'lng': 'slng'})
source_complete.head()

  source_code    slat    slng
0         AER  43.446  39.947
1         AER  43.446  39.947
2         AER  43.446  39.947
3         AER  43.446  39.947
4         AER  43.446  39.947

In [19]:
destination_complete = pd.merge(
    destination_df, lat_lng_df, how="right", on=["airport_code", "airport_code"])

destination_complete.head()

  airport_code     lat     lng
0          KZN  55.608  49.277
1          KZN  55.608  49.277
2          KZN  55.608  49.277
3          KZN  55.608  49.277
4          KZN  55.608  49.277

In [20]:
destination_complete = destination_complete.rename(columns={'airport_code': 'destination_code', 'lat': 'dlat', 'lng': 'dlng'})
destination_complete.head()

  destination_code    dlat    dlng
0              KZN  55.608  49.277
1              KZN  55.608  49.277
2              KZN  55.608  49.277
3              KZN  55.608  49.277
4              KZN  55.608  49.277

In [21]:
source_only = pd.merge(
    route_df, source_complete, how="right", on=["source_code", "source_code"])

source_only.head()

  source_code destination_code    slat    slng
0         AER              KZN  43.446  39.947
1         AER              DYU  43.446  39.947
2         AER              KIV  43.446  39.947
3         AER              MSQ  43.446  39.947
4         AER              TAS  43.446  39.947

In [ ]:
complete_merge = pd.merge(
    source_only, destination_complete, how="right", on=["destination_code", "destination_code"])

complete_merge.head()